УТ_для_edt/src/InformationRegisters/смартАналогиНоменклатуры/смартАналогиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартАналогиНоменклатуры</name>
  <comment>//++ #1646 смарт: Мосолов 20.02.2024 // Контроль разобранного оборудования и снятых запчастей</comment>
  <resources>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураАналог</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/смартАналогиНоменклатуры/ManagerModule.bsl
#Область Интерфейс

Функция МодифицироватьЗапросСпискаНоменклатуры(ТекстЗапроса) Экспорт
	
	ТекстВставки = 
	"ВЫБРАТЬ
	|	смартАналогиНоменклатуры.Номенклатура КАК Номенклатура,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ смартАналогиНоменклатуры.НоменклатураАналог) КАК КоличествоАналогов
	|ПОМЕСТИТЬ ВТАналоги
	|ИЗ
	|	РегистрСведений.смартАналогиНоменклатуры КАК смартАналогиНоменклатуры
    |
	|СГРУППИРОВАТЬ ПО
	|	смартАналогиНоменклатуры.Номенклатура";
	
	ТекстЗапроса = СтрШаблон("%1%2%3", ТекстВставки, ОбщегоНазначения.РазделительПакетаЗапросов(), ТекстЗапроса);
	
	ТекстЗамены = "СпрНоменклатура.Родитель,";
	ТекстВставки = "	ЕСТЬNULL(ВТАналоги.КоличествоАналогов, 0) КАК КоличествоАналогов,";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстЗамены, СтрШаблон("%1%2%3", ТекстЗамены, Символы.ПС, ТекстВставки));
	
	ТекстЗамены = "СправочникНоменклатура.Родитель КАК Родитель,";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстЗамены, СтрШаблон("%1%2%3", ТекстЗамены, Символы.ПС, ТекстВставки));
	
	
	ТекстЗамены = "ГДЕ
				  |	НЕ СпрНоменклатура.ЭтоГруппа";
	ТекстВставки = "		ЛЕВОЕ СОЕДИНЕНИЕ ВТАналоги КАК ВТАналоги
				   |		ПО (СпрНоменклатура.Ссылка = ВТАналоги.Номенклатура)";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстЗамены, СтрШаблон("%1%2%3", ТекстВставки, Символы.ПС, ТекстЗамены));
	
	ТекстЗамены = "ГДЕ
	              |	
				  |	НЕ СправочникНоменклатура.ЭтоГруппа";
	ТекстВставки = "		ЛЕВОЕ СОЕДИНЕНИЕ ВТАналоги КАК ВТАналоги
				   |		ПО (СправочникНоменклатура.Ссылка = ВТАналоги.Номенклатура)";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстЗамены, СтрШаблон("%1%2%3", ТекстВставки, Символы.ПС, ТекстЗамены));
	
	Возврат ТекстЗапроса;

КонецФункции

#КонецОбласти
